Repository: izzat1998/morph_ai
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Enter image name
ru: Введите название изображения

source: Image file too large (max 10MB)
ru: Файл изображения слишком большой (макс. 10МБ)

source: Please upload a valid image file
ru: Пожалуйста, загрузите корректный файл изображения

source: Cellpose Model
ru: Модель Cellpose

source: Cell Diameter (pixels)
ru: Диаметр клетки (пиксели)

source: Flow Threshold
ru: Порог потока

source: Cell Probability Threshold
ru: Порог вероятности клетки

source: Analysis Configuration
ru: Настройки анализа

source: Configure the parameters for cellpose analysis. Default values work well for most cases.
ru: Настройте параметры для анализа Cellpose. Значения по умолчанию подходят для большинства случаев.

source: Cancel
ru: Отмена

source: Choose the appropriate cellpose model for your images
ru: Выберите подходящую модель Cellpose для ваших изображений

source: Expected cell diameter in pixels (leave 0 for auto-detection)
ru: Ожидаемый диаметр клетки в пикселях (оставьте 0 для автоопределения)

source: Flow error threshold (0.4 is default, lower = more cells)
ru: Порог ошибки потока (0.4 по умолчанию, меньше = больше клеток)

source: Cell probability threshold (0.0 is default)
ru: Порог вероятности клетки (0.0 по умолчанию)

source: Diameter must be positive or 0 for auto-detection
ru: Диаметр должен быть положительным или 0 для автоопределения

source: Flow threshold must be between 0 and 3
ru: Порог потока должен быть между 0 и 3

source: Cell probability threshold must be between -6 and 6
ru: Порог вероятности клетки должен быть между -6 и 6

source: Pending
ru: Ожидание

source: Processing
ru: Обработка

source: Completed
ru: Завершено

source: Failed
ru: Ошибка

source: Cytoplasm
ru: Цитоплазма

source: Nuclei
ru: Ядра

source: Cytoplasm 2.0
ru: Цитоплазма 2.0

source: Custom
ru: Пользовательская

source: Cell image "%(name)s" uploaded successfully!
ru: Изображение клетки "%(name)s" успешно загружено!

source: Analysis completed successfully!
ru: Анализ завершен успешно!

source: Analysis failed. Please check the error details.
ru: Анализ не удался. Пожалуйста, проверьте детали ошибки.

source: Analysis must be completed before export.
ru: Анализ должен быть завершен перед экспортом.

source: Cell ID
ru: ID клетки

source: Area (px²)
ru: Площадь (пикс²)

source: Perimeter (px)
ru: Периметр (пикс)

source: Circularity
ru: Круглость

source: Eccentricity
ru: Эксцентриситет

source: Solidity
ru: Плотность

source: Extent
ru: Протяженность

source: Major Axis (px)
ru: Большая ось (пикс)

source: Minor Axis (px)
ru: Малая ось (пикс)

source: Aspect Ratio
ru: Соотношение сторон

source: Centroid X
ru: Центроид X

source: Centroid Y
ru: Центроид Y

source: Bbox X
ru: Рамка X

source: Bbox Y
ru: Рамка Y

source: Bbox Width
ru: Ширина рамки

source: Bbox Height
ru: Высота рамки

source: Analysis deleted successfully.
ru: Анализ успешно удален.

source: Upload Cells
ru: Загрузить клетки

source: My Cells
ru: Мои клетки

source: Analyses
ru: Анализы

source: Logout
ru: Выход

source: Login
ru: Вход

source: Sign Up
ru: Регистрация

source: All rights reserved.
ru: Все права защищены.

source: Export CSV
ru: Экспорт CSV

source: Back to Cell
ru: Назад к клетке

source: Status:
ru: Статус:

source: Completed:
ru: Завершено:

source: Processing Time:
ru: Время обработки:

source: seconds
ru: секунд

source: Cellpose Model:
ru: Модель Cellpose:

source: Diameter:
ru: Диаметр:

source: px
ru: пикс

source: Flow Threshold:
ru: Порог потока:

source: Cell Prob Threshold:
ru: Порог вер. клетки:

source: Quick Stats
ru: Краткая статистика

source: Cells Detected
ru: Обнаружено клеток

source: Processing...
ru: Обработка...

source: Segmentation Results
ru: Результаты сегментации

source: Original Image
ru: Оригинальное изображение

source: Segmentation Overlay
ru: Наложение сегментации

source: Segmentation image not available
ru: Изображение сегментации недоступно

source: View My Cells
ru: Посмотреть мои клетки

source: Upload Cell Images
ru: Загрузить изображения клеток

source: Home
ru: Главная

source: Welcome to Morph AI
ru: Добро пожаловать в Morph AI

source: Your intelligent transformation platform.
ru: Ваша интеллектуальная платформа трансформации.

source: Get started by creating an account or signing in.
ru: Начните с создания учетной записи или входа в систему.

source: Get Started
ru: Начать

source: Welcome back, %(name)s!
ru: Добро пожаловать, %(name)s!

source: View Analyses
ru: Посмотреть анализы

source: Cell Image Upload
ru: Загрузка изображений клеток

source: Upload and manage your cell images with automatic metadata extraction.
ru: Загружайте и управляйте изображениями клеток с автоматическим извлечением метаданных.

source: Upload Images
ru: Загрузить изображения

source: Login to Upload
ru: Войти для загрузки

source: Image Gallery
ru: Галерея изображений

source: View and organize all your uploaded cell images in one place.
ru: Просматривайте и организуйте все загруженные изображения клеток в одном месте.

source: View Gallery
ru: Посмотреть галерею

source: Login to View
ru: Войти для просмотра

source: Morphometric Analysis
ru: Морфометрический анализ

source: Use Cellpose AI to segment cells and extract comprehensive morphometric measurements.
ru: Используйте Cellpose AI для сегментации клеток и извлечения комплексных морфометрических измерений.

source: Login to Access
ru: Войти для доступа
